app/views/posts/_form.html.erb

    <%= f.label :tags %><br>
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %><br>
---
SELECT "tags".* FROM "tags"