app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "post title"], ["content", "post content"], ["created_at", "2015-07-07 18:19:43.812265"], ["updated_at", "2015-07-07 18:19:43.812265"]]
---
  def create
    #binding.pry
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save